app/views/topics/index.html.erb

        <td class="space"><%= topic.name %></td>
        <td class="space"><%= topic.comments.count %> comments</td>
---
SELECT COUNT(*) FROM "comments" WHERE "comments"."topic_id" = $1  [["topic_id", 1]]