app/views/topics/show.html.erb


<% if @topic.comments.any? %>
---
SELECT  1 AS one FROM "comments" WHERE "comments"."topic_id" = $1 LIMIT 1  [["topic_id", 1]]
SELECT "comments".* FROM "comments" WHERE "comments"."topic_id" = $1  [["topic_id", 1]]