app/controllers/comments_controller.rb

INSERT INTO "comments" ("body", "commenter", "created_at", "topic_id", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["body", ""], ["commenter", ""], ["created_at", "2014-10-13 19:30:31.220728"], ["topic_id", 1], ["updated_at", "2014-10-13 19:30:31.220728"]]
---
	def create
		@comment = Comment.create(comment_params)