app/controllers/topics_controller.rb

  def create
    @topic = Topic.new(topic_params)

    if @topic.save
---
INSERT INTO "topics" ("created_at", "name", "question", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["created_at", "2014-10-13 02:49:50.254250"], ["name", ""], ["question", ""], ["updated_at", "2014-10-13 02:49:50.254250"]]